jagadevan/contiki/cpu/cc2538/dev/gpio.c
//*****************************************************************************
//
//! Configures input pin(s) for use by the UART peripheral
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//!
//! The UART input pins must be properly configured for the UART peripheral to
//! function correctly.  This function provides a typical configuration for
//! those pin(s); other configurations might work as well depending upon the
//! board setup (for example, using the on-chip pull-ups).
//!
//! \note For PC0 through PC3 the function GPIOPinTypeUARTHiDrive() should
//! be used to configure these high drive pins.
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \note This function cannot be used to turn any pin into a UART pin; but only
//! configures a UART pin for proper operation.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPinTypeUARTInput(uint32_t ui32Port, uint8_t ui8Pins)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));
    ASSERT(!((ui32Port == GPIO_C_BASE) && ((ui8Pins & 0xf) > 0)));

    //
    // Make the pin(s) be peripheral controlled.
    //
    GPIODirModeSet(ui32Port, ui8Pins, GPIO_DIR_MODE_HW);

    //
    // Set the pad(s) to override disable.
    //
    IOCPadConfigSet(ui32Port, ui8Pins, IOC_OVERRIDE_DIS);
}

//*****************************************************************************
//
//! Configures output pin(s) for use by the UART peripheral
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//!
//! The UART output pins must be properly configured for the UART peripheral to
//! function correctly.  This function provides a typical configuration for
//! those pin(s); other configurations might work as well depending upon the
//! board setup (for example, using the on-chip pull-ups).
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \note This function cannot be used to turn any pin into a UART pin; but only
//! configures a UART pin for proper operation.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPinTypeUARTOutput(uint32_t ui32Port, uint8_t ui8Pins)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));
    ASSERT(!((ui32Port == GPIO_C_BASE) && ((ui8Pins & 0xf) > 0)));

    //
    // Make the pin(s) be peripheral controlled.
    //
    GPIODirModeSet(ui32Port, ui8Pins, GPIO_DIR_MODE_HW);

    //
    // Set the pad(s) to output enable.
    //
    IOCPadConfigSet(ui32Port, ui8Pins, IOC_OVERRIDE_OE);
}

//*****************************************************************************
//
//! Sets the power-up interrupt type for the specified pin(s)
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//! \param ui32IntType specifies type of power-up interrupt trigger mechanism.
//!
//! This function sets up the various interrupt trigger mechanisms for the
//! specified pin(s) on the selected GPIO port.
//!
//! The parameter \e ui32IntType is an enumerated data type that can be one of
//! the following values:
//!
//! - \b GPIO_POW_FALLING_EDGE
//! - \b GPIO_POW_RISING_EDGE
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \note To avoid any spurious interrupts, the user must
//! ensure that the GPIO inputs remain stable for the duration of
//! this function.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPowIntTypeSet(uint32_t ui32Port, uint8_t ui8Pins,
                  uint32_t ui32IntType)
{
    uint32_t ui32PortOffset;
    uint32_t ui32IntPins;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));
    ASSERT((ui32IntType == GPIO_POW_FALLING_EDGE) ||
           (ui32IntType == GPIO_POW_RISING_EDGE));

    //
    // Find bit mask for wanted pin(s)
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }
    ui32IntPins = ui8Pins << ui32PortOffset;

    //
    // Set the pin interrupt type.
    //
    if(ui32IntType == GPIO_POW_FALLING_EDGE)
    {
        HWREG(ui32Port + GPIO_O_P_EDGE_CTRL) |= ui32IntPins;
    }
    else  // GPIO_POW_RAISING_EDGE
    {
        HWREG(ui32Port + GPIO_O_P_EDGE_CTRL) &= ~(ui32IntPins);
    }
}

//*****************************************************************************
//
//! Gets the power-up interrupt type for a pin
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pin is the pin number.
//!
//! This function gets the interrupt type for a specified pin on the selected
//! GPIO port.  The pin can be configured as a falling edge, rising edge, or
//! both edge detected interrupt, or it can be configured as a low level or
//! high level detected interrupt.  The type of interrupt detection mechanism
//! is returned as an enumerated data type.
//!
//! \return Returns one of the enumerated data types described for
//! GPIOIntTypeSet().
//
//*****************************************************************************
uint32_t
GPIOPowIntTypeGet(uint32_t ui32Port, uint8_t ui8Pin)
{
    uint32_t ui32PortOffset;
    uint32_t ui32IntPin;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));
    ASSERT(ui8Pin < 8);

    //
    // Convert from a port- pin number to a bit position.
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }
    ui32IntPin = 1 << (ui8Pin + ui32PortOffset);

    //
    // Return the pin interrupt type.
    //
    if(HWREG(ui32Port + GPIO_O_P_EDGE_CTRL) & ui32IntPin)
    {
        return(GPIO_POW_FALLING_EDGE);
    }
    else
    {
        return(GPIO_POW_RISING_EDGE);
    }
}

//*****************************************************************************
//
//! Enables power-up interrupts for the specified pin(s)
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//!
//! Unmasks the interrupt for the specified pin(s).
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPowIntEnable(uint32_t ui32Port, uint8_t ui8Pins)
{
    uint32_t ui32PortOffset;
    uint32_t ui32IntPins;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));

    //
    // Find bit mask for wanted pin(s)
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }
    ui32IntPins = ui8Pins << ui32PortOffset;

    //
    // Enable the interrupts.
    //
    HWREG(ui32Port + GPIO_O_PI_IEN) |= ui32IntPins;
}

//*****************************************************************************
//
//! Disables power-up interrupts for the specified pin(s)
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//!
//! Masks the interrupt for the specified pin(s).
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPowIntDisable(uint32_t ui32Port, uint8_t ui8Pins)
{
    uint32_t ui32PortOffset;
    uint32_t ui32IntPins;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));

    //
    // Find bit mask for wanted pin(s)
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }
    ui32IntPins = ui8Pins << ui32PortOffset;

    //
    // Disable the interrupts.
    //
    HWREG(ui32Port + GPIO_O_PI_IEN) &= ~(ui32IntPins);
}

//*****************************************************************************
//
//! Gets power-up interrupt status for the specified GPIO port
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param bMasked specifies whether masked or raw interrupt status is
//! returned.
//!
//! If \e bMasked is set as \b true, then the masked interrupt status is
//! returned; otherwise, the raw interrupt status is returned.
//!
//! \return Returns a bit-packed byte, where each bit that is set identifies
//! an active masked or raw interrupt, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//! Bits 31:8 should be ignored.
//
//*****************************************************************************
uint32_t
GPIOPowIntStatus(uint32_t ui32Port, bool bMasked)
{
    uint32_t ui32PortOffset;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    // Check the arguments.
    ASSERT(GPIOBaseValid(ui32Port));

    //
    // Find bit mask for wanted pin(s)
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }

    // Return the interrupt status.
    if(bMasked)
    {
        return((HWREG(ui32Port + GPIO_O_IRQ_DETECT_ACK) >> ui32PortOffset) &
               0xFF);
    }
    else
    {
        return((HWREG(ui32Port + GPIO_O_IRQ_DETECT_UNMASK) >> ui32PortOffset) &
               0xFF);
    }
}

//*****************************************************************************
//
//! Clears the power-up interrupt for the specified pin(s)
//!
//! \param ui32Port is the base address of the GPIO port.
//! \param ui8Pins is the bit-packed representation of the pin(s).
//!
//! Clears the interrupt for the specified pin(s).
//!
//! The pin(s) are specified using a bit-packed byte, where each bit that is
//! set identifies the pin to be accessed, and where bit 0 of the byte
//! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, and so on.
//!
//! \return None
//
//*****************************************************************************
void
GPIOPowIntClear(uint32_t ui32Port, uint8_t ui8Pins)
{
    uint32_t ui32PortOffset;
    uint32_t ui32IntPins;

    //
    // Initialize value
    //
    ui32PortOffset = 0;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ui32Port));

    //
    // Find bit mask for wanted pin(s)
    //
    if(ui32Port == GPIO_A_BASE)
    {
        ui32PortOffset = 0;
    }
    if(ui32Port == GPIO_B_BASE)
    {
        ui32PortOffset = 8;
    }
    if(ui32Port == GPIO_C_BASE)
    {
        ui32PortOffset = 16;
    }
    if(ui32Port == GPIO_D_BASE)
    {
        ui32PortOffset = 24;
    }
    ui32IntPins = ui8Pins << ui32PortOffset;

    //
    // Clear the interrupts.
    //
    HWREG(ui32Port + GPIO_O_IRQ_DETECT_ACK) |= ui32IntPins;
}

//*****************************************************************************
//
//! Enable Wake Up Interrupt
//!
//! \param ui32Config is the source to enable wake up on interrupt.
//!
//! This function enables wake up on interrupt from the selected sources.
//!
//! The \e ui32Config argument must be one or the logical or of several of
//! the following values:
//!
//! \b GPIO_IWE_PORT_A, \b GPIO_IWE_PORT_B, \b GPIO_IWE_PORT_C,
//! \b GPIO_IWE_PORT_D, \b GPIO_IWE_USB,
//! \b GPIO_IWE_SM_TIMER.
//!
//! \return None
//
//*****************************************************************************
void
GPIOIntWakeupEnable(uint32_t ui32Config)
{
    ASSERT((ui32Config &
            (GPIO_IWE_PORT_A |
             GPIO_IWE_PORT_B |
             GPIO_IWE_PORT_C |
             GPIO_IWE_PORT_D |
             GPIO_IWE_USB |
             GPIO_IWE_SM_TIMER)) != 0);

    //
    // Enable Wakeup from selected Interrupt sources
    //
    HWREG(SYS_CTRL_IWE) |= ui32Config;
}

//*****************************************************************************
//
//! Disable Wake Up Interrupt
//!
//! \param ui32Config is the source to disable wake on interrupt from.
//!
//! This function disables Wake up on interrupt from the selected sources.
//!
//! The \e ui32Config argument must be one or the logical or of several of
//! the following values:
//!
//! \b GPIO_IWE_PORT_A, \b GPIO_IWE_PORT_B, \b GPIO_IWE_PORT_C,
//! \b GPIO_IWE_PORT_D, \b GPIO_IWE_USB,
//! \b GPIO_IWE_SM_TIMER,
//!
//! \return None
//
//*****************************************************************************
void
GPIOIntWakeupDisable(uint32_t ui32Config)
{
    ASSERT((ui32Config &
            (GPIO_IWE_PORT_A |
             GPIO_IWE_PORT_B |
             GPIO_IWE_PORT_C |
             GPIO_IWE_PORT_D |
             GPIO_IWE_USB |
             GPIO_IWE_SM_TIMER)) != 0);

    //
    // Disable Wakeup from selected Interrupt sources
    //
    HWREG(SYS_CTRL_IWE) &= ~ui32Config;
}







/** @} */
